<?php
/**
 * 时间相关方法
 * to_char(sysdate,'yyyy-mm-dd hh24:mi:ss')
 */
declare(strict_types=1);

namespace pizepei\helper;


class Date
{
    /**
     * 24小时
     */
    const HH24 = [
        '00'=>[], '01'=>[], '02'=>[], '03'=>[], '04'=>[], '05'=>[], '06'=>[], '07'=>[], '08'=>[], '09'=>[], '10'=>[],'11'=>[],'12'=>[],
        '13'=>[], '14'=>[], '15'=>[], '16'=>[], '17'=>[], '18'=>[], '19'=>[], '20'=>[], '21'=>[], '22'=>[], '23'=>[]
    ];
    /**
     * 一天的秒
     */
    const day_time = 86400;
    /**
     * 一周的秒
     */
    const week_time = 604800;
    /**
     * 一小时的秒
     */
    const h_time = 3600;
}